Repository: ZiangZhao1227/Getfit
Catalog: GetFit/*.lproj/Localizable.strings
Languages: fi

source: Login to GetFit
fi: Kirjaudu GetFitiin

source: Signup?
fi: Kirjaudu?

source: Login
fi: Kirjaudu sisään

source: Please fill in all fields.
fi: Täytä kaikki kentät.

source: Wrong Username or Password
fi: Väärä käyttäjätunnus tai salasana

source: SignUp to GetFit
fi: Rekisteröidy saadaksesi kunnon

source: Signup
fi: Kirjaudu

source: Login?
fi: Kirjaudu sisään?

source: Use 8 characters(including special & a number)
fi: Käytä 8 merkkiä (mukaan lukien erikoismerkki ja numero)

source: Welcome
fi: Tervetuloa

source: The best health assistant for all your needs.
fi: Paras terveysavustaja kaikkiin tarpeisiisi.

source: Diets
fi: Ruokavalion

source: Browse through our collection of meals.
fi: Selaa kokoelmiamme.

source: Progress
fi: Edistyminen

source: Track your progress to continue your fitness journey.
fi: Seuraa edistymistäsi jatkaaksesi kuntomatkaa.

source: Your Activity
fi: Oma toiminta

source: Weekly Activity
fi: Viikkotoiminta

source: Steps:
fi: Askeleet:

source: Distance:
fi: Etäisyys:

source: CO2 emissions:
fi: CO2-päästöt:

source: start tracking
fi: aloita seuranta

source: workout
fi: treenata

source: 4 Day Barbell Only Workout
fi: Vain 4 päivän barbell-harjoitus

source: Main Goal Build Muscle
fi: Päätavoitteen lihas

source: Are you stuck without a squat rack and bench? This 4-day upper/lower split will show you exactly how to get strong, and add muscle with only a barbell at your disposal.
fi: Oletko jumissa ilman kyykky telineitä ja penkkiä? Tämä 4 päivän ylempi / alempi jako näyttää tarkalleen kuinka saada vahvaa ja lisätä lihaksia vain sauvalla käytettävissäsi.

source: Full Body Fat Loss Workout
fi: Koko kehon rasvan menetys

source: Lose Fat
fi: Menettää rasvaa

source: There's a faster way to fat loss than the treadmill. These fat burning workouts are designed to help you start making progress with just your own body weight.
fi: Rasvanpudotukseen on nopeampi tapa kuin juoksumatto. Nämä rasvanpolttoa harjoittavat treenit on suunniteltu auttamaan sinua edistymään pelkällä omalla painolla.

source: 12 Week Full Body Workout
fi: 12 viikon kokovartaloharjoittelu

source: Build Muscle
fi: Rakentaa lihasta

source: A 12 week full body beginner workout routine designed to introduce you to a range of gym equipment and basic bodybuilding exercises in under 60 minutes.
fi: 12 viikon koko kehon aloittelijoille tarkoitettu harjoitusrutiini, jonka tarkoituksena on tutustuttaa sinut kuntosalilaitteisiin ja kehonrakennuksen perusharjoituksiin alle 60 minuutissa.

source: Workouts for Women: 2
fi: Naisten harjoittelu: 2

source: No time to make it to the gym or don't have a gym membership? These 2 bodyweight circuits are exactly what you're looking for to help you get in shape!
fi: Ei ole aikaa päästä kuntosalille tai sinulla ei ole kuntosalin jäsenyyttä? Nämä 2 kehonpainepiiriä ovat juuri sitä, mitä etsit auttamaan sinua kunnossa!

source: 6 Week Fat Loss Workout
fi: 6 viikon rasvanpudotusharjoitus

source: Kick off your summer shredding with a quick and intense program. This 6 week fat loss workout supersets resistance training with cardio for maximum workout intensity.
fi: Käynnistä kesän murskauksesi nopealla ja intensiivisellä ohjelmalla. Tämä 6 viikon rasvanpudotusharjoittelu korvaa sydämen kestävyysharjoituksen maksimaalisen harjoitteluintensiteetin saavuttamiseksi.

source: 8 Week Power Workout
fi: 8 viikon tehoharjoittelu

source: Increase Strength
fi: Lisää voimaa

source: Forget what you know about the squat, bench press, and deadlift. There's 3 new big lifts in town to help you transform your body and increase your strength.
fi: Unohda, mitä tiedät kyykkystä, penkkipunnerruksesta ja kuorman nostosta. Kaupungissa on 3 uutta isoa hissiä, jotka auttavat sinua muuttamaan kehoasi ja lisäämään voimaa.

source: Workout Programs
fi: Harjoitteluohjelmat

source: 7-Day Mediterranean Meal Plan
fi: 7 päivän Välimeren ateriasuunnitelma

source: 1,200 Calories
fi: 1,200 kaloria

source: Recognized as one of the healthiest and most delicious ways to eat, the Mediterranean diet is easy to follow with this 7-day meal plan.
fi: Välimeren ruokavalio on tunnustettu yhdeksi terveellisimmistä ja herkullisimmista ruokailutavoista tällä 7 päivän ateriasuunnitelmalla.

source: 3-Day Diabetes Meal Plan
fi: 3 päivän diabeteksen ateriasuunnitelma

source: 1,300 Calories
fi: 1,300 kaloria

source: Quick and delicious spring meals to help take the guesswork out of healthy eating for diabetes.
fi: Nopeat ja herkulliset kevätateriat auttavat arvaamaan terveellisen ruokavalion diabeteksesta.

source: Weight-Loss Meal Plan
fi: Painonlasku Ateriaohjelma

source: The season's most delicious foods come together for a week of healthy meals, snacks and meal-prep ideas, geared to help you jump-start a healthy weight loss of 1 to 2 pounds per week.
fi: Kauden herkullisimmat ruoat kokoontuvat viikoksi terveellisiä aterioita, välipaloja ja ateriavalmisteluideoita, jotka auttavat sinua aloittamaan terveellisen painonpudotuksen 1-2 kiloa viikossa.

source: 7-Day Vegetarian Meal Plan
fi: 7 päivän kasvisateriaohjelma

source: Whether you already follow a vegetarian diet or are just looking to go meatless sometimes, this 7-day vegetarian meal plan makes it easy to eat meat-free and lose weight. Eating more plant-based foods is a great way to boost your health. A vegetarian diet has been shown to reduce your risk of heart disease, type-2 diabetes and even certain types of cancer.
fi: Olitpa jo noudattamassa kasvisruokavaliota tai haluatko vain mennä lihattomaksi joskus, tämän 7 päivän kasvisateriasuunnitelman avulla on helppo syödä lihattomasti ja laihtua. Lisää kasvipohjaisia ruokia on hyvä tapa parantaa terveyttäsi Kasvisruokavalion on osoitettu vähentävän sydänsairauksien, tyypin 2 diabeteksen ja jopa tietyntyyppisten syöpien riskiä.

source: 7-Day Anti-Inflammatory Diet Plan
fi: 7 päivän anti-inflammatorinen ruokavalio

source: In this healthy 1,200-calorie meal plan, the principles of an anti-inflammatory diet come together for a week of delicious, wholesome meals and snacks, plus meal-prep tips to set you up for a successful week ahead.
fi: Tässä terveellisessä 1200 kalori-ateriasuunnitelmassa tulehdusta ehkäisevän ruokavalion periaatteet yhdistyvät viikoksi herkullisia, terveellisiä aterioita ja välipaloja sekä aterianvalmistusvinkkejä, joiden avulla voit luoda menestyvän viikon eteenpäin.

source: Clean-Eating Meal Plan for Spring
fi: Puhtaan syömisen ateriasuunnitelma keväälle

source: 1,100 Calories
fi: 1,100 kaloria

source: Eating clean is how we do things here at EatingWell—it's a simple, healthy approach to eating that focuses on foods that do the body good, while limiting the not-so-helpful items. In this clean-eating meal plan for spring, you'll find nutrient-rich foods like fruits and veggies, lean protein, whole grains and healthy fats and limited amounts of processed foods, refined grains, salt, added sugar and alcohol.
fi: Syöminen puhtaana on se, miten teemme asioita täällä EatingWellissä - se on yksinkertainen, terveellinen lähestymistapa syömiseen, joka keskittyy elintarvikkeisiin, jotka tekevät kehosta hyvää, samalla kun rajoitetaan ei-niin hyödyllisiä ruokia. Tässä kevään kevyessä ruokasuunnitelmassa löydät runsaasti ravintoaineita sisältäviä ruokia, kuten hedelmät ja vihannekset, vähärasvaista proteiinia, täysjyvätuotteita ja terveellisiä rasvoja sekä rajalliset määrät jalostettuja elintarvikkeita, puhdistettuja jyviä, suolaa, lisättyä sokeria ja alkoholia.

source: Meals
fi: Ateriat

source: Logout
fi: Kirjautua ulos
